vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA143_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nmh1000" Cversion="1.0.0" condition="driver.nmh1000.condition_id">
      <description>Driver nmh1000</description>
      <files>
        <file category="header" name="components/sensor/nmh1000/fsl_nmh1000.h" projectpath="nmh1000"/>
        <file category="sourceC" name="components/sensor/nmh1000/fsl_nmh1000.c" projectpath="nmh1000"/>
        <file category="include" name="components/sensor/nmh1000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer" Cversion="2.2.5" condition="driver.ostimer.condition_id">
      <description>OSTimer Driver</description>
      <files>
        <file category="header" name="devices/MCXA143/drivers/fsl_ostimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA143/drivers/fsl_ostimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="p3t1755" Cversion="2.0.0" condition="driver.p3t1755.condition_id">
      <description>Driver p3t1755</description>
      <files>
        <file category="header" name="components/sensor/p3t1755/fsl_p3t1755.h" projectpath="component/p3t1755"/>
        <file category="sourceC" name="components/sensor/p3t1755/fsl_p3t1755.c" projectpath="component/p3t1755"/>
        <file category="include" name="components/sensor/p3t1755/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="port" Cversion="2.5.1" condition="driver.port.condition_id">
      <description>PORT Driver</description>
      <files>
        <file category="header" name="devices/MCXA143/drivers/fsl_port.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.9.0" condition="driver.pwm.condition_id">
      <description>PWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA143/drivers/fsl_pwm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA143/drivers/fsl_pwm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.4.0" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA143/drivers/fsl_reset.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA143/drivers/fsl_reset.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="2.0.1" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="header" name="devices/MCXA143/drivers/fsl_romapi.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trdc" Cversion="2.2.1" condition="driver.trdc_1.condition_id">
      <description>TRDC Driver</description>
      <files>
        <file category="header" name="devices/MCXA143/drivers/fsl_trdc.h" projectpath="drivers"/>
        <file category="header" name="devices/MCXA143/drivers/fsl_trdc_core.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA143/drivers/fsl_trdc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trdc_soc" Cversion="2.0.0" condition="driver.trdc_soc.condition_id">
      <description>TRDC SOC Driver</description>
      <files>
        <file category="header" name="devices/MCXA143/drivers/fsl_trdc_soc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsl2561" Cversion="1.0.0" condition="driver.tsl2561.condition_id">
      <description>Driver tsl2561</description>
      <files>
        <file category="header" name="components/sensor/tsl2561/fsl_tsl2561.h" projectpath="tsl"/>
        <file category="sourceC" name="components/sensor/tsl2561/fsl_tsl2561.c" projectpath="tsl"/>
        <file category="include" name="components/sensor/tsl2561/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="utick" Cversion="2.0.5" condition="driver.utick.condition_id">
      <description>UTICK Driver</description>
      <files>
        <file category="header" name="devices/MCXA143/drivers/fsl_utick.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA143/drivers/fsl_utick.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="waketimer" Cversion="2.0.1" condition="driver.waketimer.condition_id">
      <description>WAKETIMER Driver</description>
      <files>
        <file category="header" name="devices/MCXA143/drivers/fsl_waketimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA143/drivers/fsl_waketimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wuu" Cversion="2.4.0" condition="driver.wuu.condition_id">
      <description>WUU Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA143/drivers/fsl_wuu.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA143/drivers/fsl_wuu.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wwdt" Cversion="2.1.10" condition="driver.wwdt.condition_id">
      <description>WWDT Driver</description>
      <files>
        <file category="header" name="devices/MCXA143/drivers/fsl_wwdt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA143/drivers/fsl_wwdt.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA143/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/middleware.baremetal_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MCXA143/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MCXA143/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc, mdk, cores=cm33.condition_id" category="sourceAsm" name="devices/MCXA143/utilities/fsl_memcpy.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="header" name="devices/MCXA143/utilities/debug_console/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MCXA143/utilities/debug_console/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/MCXA143/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="header" name="devices/MCXA143/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MCXA143/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/MCXA143/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="header" name="devices/MCXA143/utilities/debug_console/fsl_debug_console.h" projectpath="utilities/debug_console"/>
        <file category="sourceC" name="devices/MCXA143/utilities/debug_console/fsl_debug_console.c" projectpath="utilities/debug_console"/>
        <file category="include" name="devices/MCXA143/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="header" name="devices/MCXA143/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities/debug_console_lite"/>
        <file category="sourceC" name="devices/MCXA143/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities/debug_console_lite"/>
        <file category="include" name="devices/MCXA143/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config" Cversion="1.0.0" condition="utility.debug_console_template_config.condition_id">
      <description>Utility debug_console Template Config</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA143/utilities/debug_console/config/fsl_debug_console_conf.h" version="1.0.0" projectpath="utilities/debug_console/config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="format" Cversion="1.0.0" condition="utility.format.condition_id">
      <description>Used to format convertion</description>
      <files>
        <file category="sourceC" name="devices/MCXA143/utilities/format/fsl_format.c" projectpath="utilities"/>
        <file category="header" name="devices/MCXA143/utilities/format/fsl_format.h" projectpath="utilities"/>
        <file category="include" name="devices/MCXA143/utilities/format/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="incbin" Cversion="1.0.0" condition="utility.incbin.condition_id">
      <description>Used to include slave core binary into master core binary.</description>
      <files>
        <file condition="allOf.toolchains=armgcc, mdk.condition_id" category="sourceAsm" name="devices/MCXA143/utilities/incbin/fsl_incbin.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <files>
        <file category="header" name="devices/MCXA143/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MCXA143/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="include" name="devices/MCXA143/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="header" name="devices/MCXA143/utilities/str/fsl_str.h" projectpath="utilities/str"/>
        <file category="sourceC" name="devices/MCXA143/utilities/str/fsl_str.c" projectpath="utilities/str"/>
        <file category="include" name="devices/MCXA143/utilities/str/"/>
      </files>
    </component>
  </components>
</package>